bench/results/rust-axum/v3-20260526-194537-rust-axum/warmup-read.txt
Running 10s test @ http://localhost:3001
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.68ms  700.45us  23.42ms   82.69%
    Req/Sec     3.63k   448.17     4.58k    65.35%
  291490 requests in 10.10s, 39.20MB read
  Non-2xx or 3xx responses: 291490
Requests/sec:  28852.80
Transfer/sec:      3.88MB